iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC56xx/emptyTargetInit/mpc5600_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PMODE_0:2;
      uint64_t MMODE_0:3;
      uint64_t MOD_0:1;
      uint64_t reservedSpace0:2;
      uint64_t PMODE_1:2;
      uint64_t MMODE_1:3;
      uint64_t MOD_1:1;
      uint64_t reservedSpace1:2;
      uint64_t PMODE_2:2;
      uint64_t MMODE_2:3;
      uint64_t MOD_2:1;
      uint64_t reservedSpace2:2;
      uint64_t PMODE_3:2;
      uint64_t MMODE_3:3;
      uint64_t MOD_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPIPMCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSPIENA:1;
      uint64_t reservedSpace0:15;
      uint64_t RXRAMACCESS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIBSPIE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_0:16;
      uint64_t SET_1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGITENST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_0:16;
      uint64_t CLR_1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGITENCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SET_0:16;
      uint64_t SET_1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGITLVST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLR_0:16;
      uint64_t CLR_1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGITLVCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTFLGSUS:16;
      uint64_t INTFLGRDY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGINTFLAG;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TICKVALUE:16;
      uint64_t reservedSpace0:12;
      uint64_t CLKCTRL:2;
      uint64_t RELOAD:1;
      uint64_t TICKENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TICKCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t LPEND:7;
      uint64_t reservedSpace1:9;
      uint64_t TG:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTGPEND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG0CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG1CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG2CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG3CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG4CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG5CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG6CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG7CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG8CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG9CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG10CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG11CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG12CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG13CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG14CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCURRENT:7;
      uint64_t reservedSpace0:1;
      uint64_t PSTART:7;
      uint64_t reservedSpace1:1;
      uint64_t TRIGSRC:4;
      uint64_t TRIGEVT:4;
      uint64_t reservedSpace2:4;
      uint64_t TGTD:1;
      uint64_t PRST:1;
      uint64_t ONESHOT:1;
      uint64_t TGENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TG15CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT_0:6;
      uint64_t COUNT_1:1;
      uint64_t reservedSpace0:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA0CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT_0:6;
      uint64_t COUNT_1:1;
      uint64_t reservedSpace0:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA1CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT_0:6;
      uint64_t COUNT_1:1;
      uint64_t reservedSpace0:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA2CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT_0:6;
      uint64_t COUNT_1:1;
      uint64_t reservedSpace0:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA3CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT_0:6;
      uint64_t COUNT_1:1;
      uint64_t reservedSpace0:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA4CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT_0:6;
      uint64_t COUNT_1:1;
      uint64_t reservedSpace0:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA5CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT_0:6;
      uint64_t COUNT_1:1;
      uint64_t reservedSpace0:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA6CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT_0:6;
      uint64_t COUNT_1:1;
      uint64_t reservedSpace0:1;
      uint64_t ICOUNT:5;
      uint64_t NOBRK:1;
      uint64_t TXDMAENA:1;
      uint64_t RXDMAENA:1;
      uint64_t TXDMA_MAP:4;
      uint64_t RXDMA_MAP:4;
      uint64_t BUFID:7;
      uint64_t ONESHOT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMA7CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:16;
      uint64_t ICOUNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICOUNT_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LARGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACNTLEN;

