iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC56xx/emptyTargetInit/mpc5600_sfr.h
};

#define Multi_buffer_RAM_MibSPI5_0 (*(volatile struct Multi_buffer_RAM_MibSPI5_0_tag *) 0xff0a0000)

struct ADC_ADC0_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADRSTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC_EN:1;
      uint64_t reservedSpace0:15;
      uint64_t RAM_TEST_EN:1;
      uint64_t reservedSpace1:7;
      uint64_t COS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADOPMODECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCLOCKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAL_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t HILO:1;
      uint64_t BRIDGE_EN:1;
      uint64_t reservedSpace1:6;
      uint64_t CAL_ST:1;
      uint64_t reservedSpace2:7;
      uint64_t SELF_TEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCALCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ_EV:1;
      uint64_t EV_MODE:1;
      uint64_t reservedSpace0:2;
      uint64_t OVR_EV_RAM_IGN:1;
      uint64_t EV_CHID:1;
      uint64_t reservedSpace1:2;
      uint64_t EV_DATA_FMT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVMODECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ_G1:1;
      uint64_t G1_MODE:1;
      uint64_t reservedSpace0:1;
      uint64_t G1_HW_TRIG:1;
      uint64_t OVR_G1_RAM_IGN:1;
      uint64_t G1_CHID:1;
      uint64_t reservedSpace1:2;
      uint64_t G1_DATA_FMT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1MODECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ_G2:1;
      uint64_t G2_MODE:1;
      uint64_t reservedSpace0:1;
      uint64_t G2_HW_TRIG:1;
      uint64_t OVR_G2_RAM_IGN:1;
      uint64_t G2_CHID:1;
      uint64_t reservedSpace1:2;
      uint64_t G2_DATA_FMT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2MODECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVSRC:3;
      uint64_t EV_EDG_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVSRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1SRC:3;
      uint64_t G1_EDG_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2SRC:3;
      uint64_t G2_EDG_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_THR_INT_EN:1;
      uint64_t EV_OVR_INT_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t EV_END_INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVINTENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_THR_INT_EN:1;
      uint64_t G1_OVR_INT_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t G1_END_INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1INTENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_THR_INT_EN:1;
      uint64_t G2_OVR_INT_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t G2_END_INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2INTENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_THR_INT_FLG:1;
      uint64_t EV_MEM_OVERRUN:1;
      uint64_t EV_MEM_EMPTY:1;
      uint64_t EV_END:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVINTFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_THR_INT_FLG:1;
      uint64_t G1_MEM_OVERRUN:1;
      uint64_t G1_MEM_EMPTY:1;
      uint64_t G1_END:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1INTFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_THR_INT_FLG:1;
      uint64_t G2_MEM_OVERRUN:1;
      uint64_t G2_MEM_EMPTY:1;
      uint64_t G2_END:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2INTFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_THR:9;
      uint64_t Sign_Extension:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVTHRINTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_THR:9;
      uint64_t Sign_Extension:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1THRINTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_THR:9;
      uint64_t Sign_Extension:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2THRINTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_DMA_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t EV_BLK_XFER:1;
      uint64_t reservedSpace1:13;
      uint64_t EVBLOCKS:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVDMACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_DMA_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t G1_BLK_XFER:1;
      uint64_t reservedSpace1:13;
      uint64_t G1BLOCKS:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1DMACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_DMA_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t G2_BLK_XFER:1;
      uint64_t reservedSpace1:13;
      uint64_t G2BLOCKS:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2DMACR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDB:9;
      uint64_t reservedSpace0:7;
      uint64_t BNDA:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADBNDCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BNDEND:3;
      uint64_t reservedSpace0:13;
      uint64_t BUF_Init_Active:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADBNDEND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_ACQ:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVSAMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_ACQ:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1SAMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_ACQ:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2SAMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_END:1;
      uint64_t EV_STOP:1;
      uint64_t EV_BUSY:1;
      uint64_t EV_MEM_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_END:1;
      uint64_t G1_STOP:1;
      uint64_t G1_BUSY:1;
      uint64_t G1_MEM_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_END:1;
      uint64_t G2_STOP:1;
      uint64_t G2_BUSY:1;
      uint64_t G2_MEM_EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_SEL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADEVSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G1_SEL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG1SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t G2_SEL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADG2SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCALR:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCALR;

