iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC56xx/emptyTargetInit/mpc5600_sfr.h
  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG0ENA:1;
      uint64_t ACCR:1;
      uint64_t INTENA0:1;
      uint64_t REG01ENA:1;
      uint64_t ACCR01:1;
      uint64_t INTENA01:1;
      uint64_t reservedSpace0:2;
      uint64_t CPNUM1:4;
      uint64_t reservedSpace1:4;
      uint64_t MPEFT0:1;
      uint64_t MPEFT1:1;
      uint64_t reservedSpace2:6;
      uint64_t CPNUM0:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTU_MPCS;

  uint32_t HTU_MP0S;
  uint32_t HTU_MP0E;
};

#define HTU_0 (*(volatile struct HTU_0_tag *) 0xff4e0000)

struct DMA_0_tag
{
  uint32_t ISADDR;
  uint32_t IDADDR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IETCOUNT:13;
      uint64_t reservedSpace0:3;
      uint64_t IFTCOUNT:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ITCOUNT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AIM:1;
      uint64_t ADDMW:2;
      uint64_t ADDMR:2;
      uint64_t reservedSpace0:3;
      uint64_t TTYPE:1;
      uint64_t reservedSpace1:3;
      uint64_t WES:2;
      uint64_t RES:2;
      uint64_t CHAIN:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIDXS:13;
      uint64_t reservedSpace0:3;
      uint64_t EIDXD:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIOFF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIDXS:13;
      uint64_t reservedSpace0:3;
      uint64_t FIDXD:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIOFF;

  uint8_t res1[2020];

  uint32_t CSADDR;
  uint32_t CDADDR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CETCOUNT:13;
      uint64_t reservedSpace0:3;
      uint64_t CFTCOUNT:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTCOUNT;

  uint8_t res2[518132];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMA_bitfield:1;
      uint64_t reservedSpace0:7;
      uint64_t DEBUG:2;
      uint64_t reservedSpace1:4;
      uint64_t BUS:1;
      uint64_t reservedSpace2:1;
      uint64_t DMA_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEND:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEND;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STCH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMASTAT;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HWCHENA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWCHENAS;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HWCHDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWCHENAR;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWCHENA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWCHENAS;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWCHDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWCHENAR;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHPRIOS;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHPRIOR;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCHIE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCHIENAS;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCHID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCHIENAR;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH3ASI:6;
      uint64_t reservedSpace0:2;
      uint64_t CH2ASI:6;
      uint64_t reservedSpace1:2;
      uint64_t CH1ASI:6;
      uint64_t reservedSpace2:2;
      uint64_t CH0ASI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DREQASI0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH7ASI:6;
      uint64_t reservedSpace0:2;
      uint64_t CH6ASI:6;
      uint64_t reservedSpace1:2;
      uint64_t CH5ASI:6;
      uint64_t reservedSpace2:2;
      uint64_t CH4ASI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DREQASI1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH11ASI:6;
      uint64_t reservedSpace0:2;
      uint64_t CH10ASI:6;
      uint64_t reservedSpace1:2;
      uint64_t CH9ASI:6;
      uint64_t reservedSpace2:2;
      uint64_t CH8ASI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DREQASI2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH15ASI:6;
      uint64_t reservedSpace0:2;
      uint64_t CH14ASI:6;
      uint64_t reservedSpace1:2;
      uint64_t CH13ASI:6;
      uint64_t reservedSpace2:2;
      uint64_t CH12ASI:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DREQASI3;

  uint8_t res13[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH7PA:3;
      uint64_t reservedSpace0:1;
      uint64_t CH6PA:3;
      uint64_t reservedSpace1:1;
      uint64_t CH5PA:3;
      uint64_t reservedSpace2:1;
      uint64_t CH4PA:3;
      uint64_t reservedSpace3:1;
      uint64_t CH3PA:3;
      uint64_t reservedSpace4:1;
      uint64_t CH2PA:3;
      uint64_t reservedSpace5:1;
      uint64_t CH1PA:3;
      uint64_t reservedSpace6:1;
      uint64_t CH0PA:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH15PA:3;
      uint64_t reservedSpace0:1;
      uint64_t CH14PA:3;
      uint64_t reservedSpace1:1;
      uint64_t CH13PA:3;
      uint64_t reservedSpace2:1;
      uint64_t CH12PA:3;
      uint64_t reservedSpace3:1;
      uint64_t CH11PA:3;
      uint64_t reservedSpace4:1;
      uint64_t CH10PA:3;
      uint64_t reservedSpace5:1;
      uint64_t CH9PA:3;
      uint64_t reservedSpace6:1;
      uint64_t CH8PA:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAR1;

  uint8_t res14[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTCAB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTCMAP;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFSAB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFSMAP;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HBCAB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HBCMAP;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTCAB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BTCMAP;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BERAB:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BERMAP;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTCINTENA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTCINTENAS;

  uint8_t res20[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTCINTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTCINTENAR;

  uint8_t res21[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFSINTENA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFSINTENAS;

  uint8_t res22[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFSINTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFSINTENAR;

  uint8_t res23[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HBCINTENA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HBCINTENAS;

  uint8_t res24[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HBCINTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HBCINTENAR;

  uint8_t res25[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTCINTENA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BTCINTENAS;

  uint8_t res26[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTCINTDIS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BTCINTENAR;

  uint8_t res27[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GINT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GINTFLAG;

