iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC56xx/emptyTargetInit/mpc5600_sfr.h
  uint32_t PSA_SIGREGL2;
  uint32_t PSA_SIGREGH2;
  uint32_t CRC_REGL2;
  uint32_t PSA_REGH2;
  uint32_t PSA_SECSIGREGL2;
  uint32_t PSA_SECSIGREGH2;
  uint32_t RAW_DATAREGL2;
  uint32_t RAW_DATAREGH2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_PAT_COUNT3:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_PCOUNT_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_SEC_COUNT3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_SCOUNT_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_CURSEC3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_CURSEC_REG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_WDTOPLD3:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_WDTOPLD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_BCTCPLD3:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_BCTOPLD3;

  uint8_t res10[12];

  uint32_t PSA_SIGREGL3;
  uint32_t PSA_SIGREGH3;
  uint32_t CRC_REGL3;
  uint32_t PSA_REGH3;
  uint32_t PSA_SECSIGREGL3;
  uint32_t PSA_SECSIGREGH3;
  uint32_t RAW_DATAREGL3;
  uint32_t RAW_DATAREGH3;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_PAT_COUNT4:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_PCOUNT_REG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_SEC_COUNT4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_SCOUNT_REG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_CURSEC4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_CURSEC_REG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_WDTOPLD4:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_WDTOPLD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC_BCTCPLD4:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRC_BCTOPLD4;

  uint8_t res11[12];

  uint32_t PSA_SIGREGL4;
  uint32_t PSA_SIGREGH4;
  uint32_t CRC_REGL4;
  uint32_t PSA_REGH4;
  uint32_t PSA_SECSIGREGL4;
  uint32_t PSA_SECSIGREGH4;
  uint32_t RAW_DATAREGL4;
  uint32_t RAW_DATAREGH4;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITCMEn:1;
      uint64_t DTCMEn:1;
      uint64_t MEn:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCRC_TRACE_BUS_SEL;

};

#define CRC_0 (*(volatile struct CRC_0_tag *) 0xfe000000)

struct CCM_R4F_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STE:1;
      uint64_t STET:1;
      uint64_t reservedSpace0:6;
      uint64_t STC_bitfield:1;
      uint64_t reservedSpace1:7;
      uint64_t CMPE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCMSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MKEY:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCMKEYR;

};

#define CCM_R4F_0 (*(volatile struct CCM_R4F_0_tag *) 0xfffff600)

struct VIM_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARFLG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARENA:4;
      uint64_t reservedSpace0:4;
      uint64_t TEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Word_offset:2;
      uint64_t ADDERR:7;
      uint64_t Interrupt_Vector_Table_offset:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADDERR;

  uint32_t FBPARERR;
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQINDEX:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQINDEX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIQINDEX:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIQINDEX;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t FIRQPR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIRQPR0;

  uint32_t FIRQPR1;
  uint32_t FIRQPR2;
  uint8_t res2[4];

  uint32_t INTREQ0;
  uint32_t INTREQ1;
  uint32_t INTREQ2;
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t REQENASET:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REQENASET0;

  uint32_t REQENASET1;
  uint32_t REQENASET2;
  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t REQENACLR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REQENACLR0;

  uint32_t REQENACLR1;
  uint32_t REQENACLR2;
  uint8_t res5[4];

  uint32_t WAKEENASET0;
  uint32_t WAKEENASET1;
  uint32_t WAKEENASET2;
  uint8_t res6[4];

  uint32_t WAKEENACLR0;
  uint32_t WAKEENACLR1;
  uint32_t WAKEENACLR2;
  uint8_t res7[4];

  uint32_t IRQVECREG;
  uint32_t FIQVECREG;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPEVTSRC0:7;
      uint64_t reservedSpace0:9;
      uint64_t CAPEVTSRC1:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAPEVT;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP3:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP2:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP1:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP0:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP7:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP6:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP5:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP4:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP11:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP10:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP9:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP8:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP15:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP14:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP13:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP12:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP19:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP18:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP17:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP16:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP23:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP22:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP21:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP20:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP27:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP26:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP25:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP24:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP31:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP30:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP29:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP28:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP35:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP34:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP33:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP32:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP39:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP38:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP37:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP36:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP43:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP42:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP41:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP40:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP47:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP46:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP45:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP44:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP51:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP50:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP49:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP48:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP55:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP54:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP53:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP52:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP59:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP58:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP57:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP56:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP63:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP62:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP61:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP60:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP67:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP66:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP65:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP64:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP71:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP70:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP69:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP68:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP75:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP74:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP73:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP72:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP79:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP78:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP77:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP76:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP83:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP82:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP81:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP80:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP87:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP86:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP85:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP84:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP91:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP90:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP89:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP88:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANMAP95:7;
      uint64_t reservedSpace0:1;
      uint64_t CHANMAP94:7;
      uint64_t reservedSpace1:1;
      uint64_t CHANMAP93:7;
      uint64_t reservedSpace2:1;
      uint64_t CHANMAP92:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHANCTRL23;

