iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC56xx/emptyTargetInit/mpc5600_sfr.h
  uint8_t res28[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTCI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTCFLAG;

  uint8_t res29[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFSI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFSFLAG;

  uint8_t res30[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HBCI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HBCFLAG;

  uint8_t res31[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTCI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BTCFLAG;

  uint8_t res32[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BERI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BERFLAG;

  uint8_t res33[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTCA:6;
      uint64_t sbz:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTCAOFFSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFSA:6;
      uint64_t sbz:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFSAOFFSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HBCA:6;
      uint64_t sbz:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HBCAOFFSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTCA:6;
      uint64_t sbz:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BTCAOFFSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BERA:6;
      uint64_t sbz:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BERAOFFSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTCB:6;
      uint64_t sbz:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTCBOFFSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFSB:6;
      uint64_t sbz:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LFSBOFFSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HBCB:6;
      uint64_t sbz:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HBCBOFFSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTCB:6;
      uint64_t sbz:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BTCBOFFSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BERB:6;
      uint64_t sbz:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BERBOFFSET;

  uint8_t res34[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t PSFRLQPB:1;
      uint64_t PSFRHQPB:1;
      uint64_t BYB:1;
      uint64_t reservedSpace1:5;
      uint64_t PENDB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PTCRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBGEN:1;
      uint64_t reservedSpace0:15;
      uint64_t DMADBGS:1;
      uint64_t reservedSpace1:7;
      uint64_t CHNUM:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCTRL;

  uint32_t WPR;
  uint32_t WMR;
  uint32_t PAACSADDR;
  uint32_t PAACDADDR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAETCOUNT:13;
      uint64_t reservedSpace0:3;
      uint64_t PAFTCOUNT:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAACTC;

  uint32_t PBACSADDR;
  uint32_t PBACDADDR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PBETCOUNT:13;
      uint64_t reservedSpace0:3;
      uint64_t PBFTCOUNT:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PBACTC;

  uint8_t res35[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARITY_ENA:4;
      uint64_t reservedSpace0:4;
      uint64_t TEST:1;
      uint64_t reservedSpace1:7;
      uint64_t ERRA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRORADDRESS:12;
      uint64_t reservedSpace0:12;
      uint64_t EDFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAPAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG0ENA:1;
      uint64_t REG0AP:2;
      uint64_t INT0ENA:1;
      uint64_t INT0AB:1;
      uint64_t reservedSpace0:3;
      uint64_t REG1ENA:1;
      uint64_t REG1AP:2;
      uint64_t INT1ENA:1;
      uint64_t INT1AB:1;
      uint64_t reservedSpace1:3;
      uint64_t REG2ENA:1;
      uint64_t REG2AP:2;
      uint64_t INT2ENA:1;
      uint64_t INT2AB:1;
      uint64_t reservedSpace2:3;
      uint64_t REG3ENA:1;
      uint64_t REG3AP:2;
      uint64_t INT3ENA:1;
      uint64_t INT3AB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMPCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG0FT:1;
      uint64_t reservedSpace0:7;
      uint64_t REG1FT:1;
      uint64_t reservedSpace1:7;
      uint64_t REG2FT:1;
      uint64_t reservedSpace2:7;
      uint64_t REG3FT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAMPST;

  uint32_t DMAMPR0S;
  uint32_t DMAMPR0E;
  uint32_t DMAMPR1S;
  uint32_t DMAMPR1E;
  uint32_t DMAMPR2S;
  uint32_t DMAMPR2E;
  uint32_t DMAMPR3S;
  uint32_t DMAMPR3E;
};

#define DMA_1 (*(volatile struct DMA_1_tag *) 0xfff80000)

struct RTI_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT0EN:1;
      uint64_t CNT1EN:1;
      uint64_t reservedSpace0:13;
      uint64_t COS:1;
      uint64_t NTUSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIGCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBEXT:1;
      uint64_t INC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTITBCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPCNTR0:1;
      uint64_t CAPCNTR1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICAPCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMPSEL0:1;
      uint64_t reservedSpace0:3;
      uint64_t COMPSEL1:1;
      uint64_t reservedSpace1:3;
      uint64_t COMPSEL2:1;
      uint64_t reservedSpace2:3;
      uint64_t COMPSEL3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICOMPCTRL;

  uint32_t RTIFRC0;
  uint32_t RTIUC0;
  uint32_t RTICPUC0;
  uint8_t res0[4];

  uint32_t RTICAFRC0;
  uint32_t RTICAUC0;
  uint8_t res1[8];

  uint32_t RTIFRC1;
  uint32_t RTIUC1;
  uint32_t RTICPUC1;
  uint8_t res2[4];

  uint32_t RTICAFRC1;
  uint32_t RTICAUC1;
  uint8_t res3[8];

  uint32_t RTICOMP0;
  uint32_t RTIUDCP0;
  uint32_t RTICOMP1;
  uint32_t RTIUDCP1;
  uint32_t RTICOMP2;
  uint32_t RTIUDCP2;
  uint32_t RTICOMP3;
  uint32_t RTIUDCP3;
  uint32_t RTITBLCOMP;
  uint32_t RTITBHCOMP;
  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETINT:4;
      uint64_t reservedSpace0:4;
      uint64_t SETDMA:4;
      uint64_t reservedSpace1:4;
      uint64_t SETTBINT:1;
      uint64_t SETOVLINT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTISETINTENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLEARINT:4;
      uint64_t reservedSpace0:4;
      uint64_t CLEARDMA:4;
      uint64_t reservedSpace1:4;
      uint64_t CLEARTBINT:1;
      uint64_t CLEAROVLINT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTICLEARINTENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:4;
      uint64_t reservedSpace0:12;
      uint64_t TBINT:1;
      uint64_t OVLINT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTIINTFLAG;

