iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC56xx/emptyTargetInit/mpc5600_sfr.h
};

#define CGM (*(volatile struct CGM_tag *) 0xc3fe0370)

struct FXOSC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t I_OSC:1;
      uint64_t OSCDIV:5;
      uint64_t reservedSpace1:2;
      uint64_t M_OSC:1;
      uint64_t EOCV:8;
      uint64_t reservedSpace2:7;
      uint64_t OSCBYP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FXOSC_CTL;

};

#define FXOSC (*(volatile struct FXOSC_tag *) 0xc3fe0000)

struct SXOSC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSCON:1;
      uint64_t S_OSC:1;
      uint64_t reservedSpace0:5;
      uint64_t I_OSC:1;
      uint64_t OSCDIV:5;
      uint64_t reservedSpace1:2;
      uint64_t M_OSC:1;
      uint64_t EOCV:8;
      uint64_t reservedSpace2:7;
      uint64_t OSCBYP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SXOSC_CTL;

};

#define SXOSC (*(volatile struct SXOSC_tag *) 0xc3fe0040)

struct SIRC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPRCON_STDBY:1;
      uint64_t reservedSpace0:3;
      uint64_t S_LPRC:1;
      uint64_t reservedSpace1:3;
      uint64_t LPRCDIV:5;
      uint64_t reservedSpace2:3;
      uint64_t LPRCTRIM:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPRC_CTL;

};

#define SIRC (*(volatile struct SIRC_tag *) 0xc3fe0080)

struct FIRC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t RCDIV:5;
      uint64_t reservedSpace1:3;
      uint64_t RCTRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RC_CTL;

};

#define FIRC (*(volatile struct FIRC_tag *) 0xc3fe0060)

struct FMPLL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PLL_FAIL_FLAG:1;
      uint64_t PLL_FAIL_MASK:1;
      uint64_t S_LOCK:1;
      uint64_t I_LOCK:1;
      uint64_t reservedSpace1:1;
      uint64_t UNLOCK_ONCE:1;
      uint64_t MODE_bitfield:1;
      uint64_t EN_PLL_SW:1;
      uint64_t reservedSpace2:7;
      uint64_t NDIV:7;
      uint64_t reservedSpace3:1;
      uint64_t ODF:2;
      uint64_t IDF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INC_STEP:15;
      uint64_t FM_EN:1;
      uint64_t MOD_PERIOD:13;
      uint64_t SPRD_SEL:1;
      uint64_t reservedSpace0:1;
      uint64_t STRB_BYPASS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MR;

};

#define FMPLL (*(volatile struct FMPLL_tag *) 0xc3fe00a0)

struct CMU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CME_A:1;
      uint64_t RCDIV:2;
      uint64_t reservedSpace0:5;
      uint64_t CKSEL:2;
      uint64_t reservedSpace1:13;
      uint64_t SFM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMU_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMU_FDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMU_HFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMU_LFREFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OLRI:1;
      uint64_t FLLI:1;
      uint64_t FHHI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMU_ISR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMU_MDR;

};

#define CMU (*(volatile struct CMU_tag *) 0xc3fe0100)

struct MODE_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t S_SYSCLK:4;
      uint64_t S_16MHz_IRC:1;
      uint64_t S_XOSC0:1;
      uint64_t S_PLL0:1;
      uint64_t reservedSpace0:9;
      uint64_t S_CFLA:2;
      uint64_t S_DFLA:2;
      uint64_t S_MVR:1;
      uint64_t reservedSpace1:5;
      uint64_t S_DC:1;
      uint64_t S_MTRANS:1;
      uint64_t S_CURRENT_MODE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_GS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:16;
      uint64_t reservedSpace0:12;
      uint64_t TARGET_MODE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_MCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
      uint64_t HALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace1:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_ME;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I_MTC:1;
      uint64_t I_SAFE:1;
      uint64_t I_IMODE:1;
      uint64_t I_ICONF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_IS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M_MTC:1;
      uint64_t M_SAFE:1;
      uint64_t M_IMODE:1;
      uint64_t M_ICONF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_IM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S_SEA:1;
      uint64_t S_NMA:1;
      uint64_t S_DMA:1;
      uint64_t S_MRI:1;
      uint64_t S_MTI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_IMTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CDP_PRPH_0_31:1;
      uint64_t CDP_PRPH_32_63:1;
      uint64_t CDP_PRPH_64_95:1;
      uint64_t CDP_PRPH_96_127:1;
      uint64_t reservedSpace0:3;
      uint64_t CDP_PRPH_0_143:1;
      uint64_t CFLASH_SC:1;
      uint64_t DFLASH_SC:1;
      uint64_t SYSCLK_SW:1;
      uint64_t reservedSpace1:1;
      uint64_t FIRC_SC:1;
      uint64_t FXOSC_SC:1;
      uint64_t FMPLL_SC:1;
      uint64_t reservedSpace2:1;
      uint64_t SMR:1;
      uint64_t reservedSpace3:2;
      uint64_t CORE_DBG:1;
      uint64_t PMC_PROG:1;
      uint64_t reservedSpace4:2;
      uint64_t MPH_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_DMTS;

