iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC56xx/emptyTargetInit/mpc5600_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t MHz_IRCON:1;
      uint64_t XOSC0ON:1;
      uint64_t PLL0ON:1;
      uint64_t reservedSpace0:9;
      uint64_t CFLAON:2;
      uint64_t DFLAON:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace1:2;
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_RESET_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t MHz_IRCON:1;
      uint64_t XOSC0ON:1;
      uint64_t PLL0ON:1;
      uint64_t reservedSpace0:9;
      uint64_t CFLAON:2;
      uint64_t DFLAON:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace1:2;
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_TEST_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t MHz_IRCON:1;
      uint64_t XOSC0ON:1;
      uint64_t PLL0ON:1;
      uint64_t reservedSpace0:9;
      uint64_t CFLAON:2;
      uint64_t DFLAON:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace1:2;
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_SAFE_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t MHz_IRCON:1;
      uint64_t XOSC0ON:1;
      uint64_t PLL0ON:1;
      uint64_t reservedSpace0:9;
      uint64_t CFLAON:2;
      uint64_t DFLAON:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace1:2;
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_DRUN_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t MHz_IRCON:1;
      uint64_t XOSC0ON:1;
      uint64_t PLL0ON:1;
      uint64_t reservedSpace0:9;
      uint64_t CFLAON:2;
      uint64_t DFLAON:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace1:2;
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_RUN0_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t MHz_IRCON:1;
      uint64_t XOSC0ON:1;
      uint64_t PLL0ON:1;
      uint64_t reservedSpace0:9;
      uint64_t CFLAON:2;
      uint64_t DFLAON:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace1:2;
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_RUN1_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t MHz_IRCON:1;
      uint64_t XOSC0ON:1;
      uint64_t PLL0ON:1;
      uint64_t reservedSpace0:9;
      uint64_t CFLAON:2;
      uint64_t DFLAON:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace1:2;
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_RUN2_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t MHz_IRCON:1;
      uint64_t XOSC0ON:1;
      uint64_t PLL0ON:1;
      uint64_t reservedSpace0:9;
      uint64_t CFLAON:2;
      uint64_t DFLAON:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace1:2;
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_RUN3_MC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t MHz_IRCON:1;
      uint64_t XOSC0ON:1;
      uint64_t PLL0ON:1;
      uint64_t reservedSpace0:9;
      uint64_t CFLAON:2;
      uint64_t DFLAON:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace1:2;
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_HALT0_MC;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t MHz_IRCON:1;
      uint64_t XOSC0ON:1;
      uint64_t PLL0ON:1;
      uint64_t reservedSpace0:9;
      uint64_t CFLAON:2;
      uint64_t DFLAON:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace1:2;
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_STOP0_MC;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCLK:4;
      uint64_t MHz_IRCON:1;
      uint64_t XOSC0ON:1;
      uint64_t PLL0ON:1;
      uint64_t reservedSpace0:9;
      uint64_t CFLAON:2;
      uint64_t DFLAON:2;
      uint64_t MVRON:1;
      uint64_t reservedSpace1:2;
      uint64_t PDO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_STANDBY0_MC;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t S_DSPI02:3;
      uint64_t reservedSpace1:9;
      uint64_t S_FlexCAN05:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_PS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S_ADC0:1;
      uint64_t reservedSpace0:11;
      uint64_t S_I2C_DMA0:1;
      uint64_t reservedSpace1:3;
      uint64_t S_LIN_FLEX03:4;
      uint64_t reservedSpace2:5;
      uint64_t S_CTUL:1;
      uint64_t reservedSpace3:2;
      uint64_t S_CANSampler_Peripheral_status:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_PS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t S_SIUL:1;
      uint64_t S_WKPU:1;
      uint64_t reservedSpace1:2;
      uint64_t S_eMIOS01:2;
      uint64_t reservedSpace2:17;
      uint64_t S_RTCAPI_Peripheral_status:1;
      uint64_t S_PIT_RTI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_PS2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t S_CMU0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_PS3;

  uint8_t res4[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_RUN_PC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_RUN_PC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_RUN_PC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_RUN_PC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_RUN_PC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_RUN_PC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_RUN_PC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN0:1;
      uint64_t RUN1:1;
      uint64_t RUN2:1;
      uint64_t RUN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_RUN_PC7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_LP_PC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_LP_PC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_LP_PC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_LP_PC3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_LP_PC4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_LP_PC5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_LP_PC6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HALT0:1;
      uint64_t reservedSpace1:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace2:2;
      uint64_t STANDBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ME_LP_PC7;

