iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC56xx/emptyTargetInit/mpc5600_sfr.h
};

#define DMA_MUX (*(volatile struct DMA_MUX_tag *) 0xfffdc000)

struct XBAR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_MPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_AMPR0;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_SGPCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_ASGPCR0;

  uint8_t res1[232];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_MPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_AMPR1;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_SGPCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_ASGPCR1;

  uint8_t res3[232];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_MPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_AMPR2;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_SGPCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_ASGPCR2;

  uint8_t res5[232];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_MPR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_AMPR3;

