iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC56xx/emptyTargetInit/mpc5600_sfr.h
  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_SGPCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_ASGPCR3;

  uint8_t res7[232];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_MPR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_AMPR4;

  uint8_t res8[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_SGPCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_ASGPCR4;

  uint8_t res9[232];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_MPR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_AMPR5;

  uint8_t res10[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_SGPCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_ASGPCR5;

  uint8_t res11[232];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_MPR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_AMPR6;

  uint8_t res12[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_SGPCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_ASGPCR6;

  uint8_t res13[232];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_MPR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTR_0:3;
      uint64_t reservedSpace0:1;
      uint64_t MSTR_1:3;
      uint64_t reservedSpace1:1;
      uint64_t MSTR_2:3;
      uint64_t reservedSpace2:1;
      uint64_t MSTR_3:3;
      uint64_t reservedSpace3:1;
      uint64_t MSTR_4:3;
      uint64_t reservedSpace4:1;
      uint64_t MSTR_5:3;
      uint64_t reservedSpace5:1;
      uint64_t MSTR_6:3;
      uint64_t reservedSpace6:1;
      uint64_t MSTR_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_AMPR7;

  uint8_t res14[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_SGPCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE:8;
      uint64_t reservedSpace3:6;
      uint64_t HLP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XBAR_ASGPCR7;

  uint8_t res15[232];

  uint32_t XBAR_MGPCR0;
  uint8_t res16[252];

