iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC56xx/emptyTargetInit/mpc5600_sfr.h
};

#define INTC (*(volatile struct INTC_tag *) 0xfff48000)

struct SIUL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MINOR_MASK:4;
      uint64_t MAJOR_MASK:4;
      uint64_t reservedSpace0:2;
      uint64_t PKG:5;
      uint64_t CSP:1;
      uint64_t PARTNUM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t EE:1;
      uint64_t reservedSpace1:3;
      uint64_t PARTNUM:8;
      uint64_t reservedSpace2:7;
      uint64_t FLASH_SIZE_2:4;
      uint64_t FLASH_SIZE_1:4;
      uint64_t SF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR2;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRER;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IREE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IREER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFEE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFEER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFE:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFER;

  uint8_t res2[12];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR16;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR17;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR18;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR19;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR20;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR21;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR22;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR23;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR24;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR25;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR26;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR27;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR28;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR29;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR30;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR31;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR32;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR33;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR34;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR35;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR36;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR37;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR38;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR39;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR40;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR41;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR42;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR43;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR44;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR45;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR46;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR47;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR48;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR49;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR50;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR51;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR52;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR53;

