iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC56xx/emptyTargetInit/mpc5600_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR111;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR112;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR113;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR114;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR115;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR116;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR117;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR118;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR119;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR120;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR121;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR122;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR123;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR124;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR125;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR126;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR127;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR128;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR129;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR130;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR131;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR132;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR133;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR134;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR135;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR136;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR137;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR138;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR139;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR140;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR141;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR142;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR143;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR144;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR145;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR146;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR147;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WPS:1;
      uint64_t WPE:1;
      uint64_t SRC:1;
      uint64_t reservedSpace0:2;
      uint64_t ODE:1;
      uint64_t reservedSpace1:2;
      uint64_t IBE:1;
      uint64_t OBE:1;
      uint64_t PA:2;
      uint64_t reservedSpace2:1;
      uint64_t APC:1;
      uint64_t SMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCR148;

