iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC56xx/emptyTargetInit/mpc5600_sfr.h
};

#define eMIOS_eMIOS1 (*(volatile struct eMIOS_eMIOS1_tag *) 0xc3fa4000)

struct WKPU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t NOVF:1;
      uint64_t NIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NSR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t NFE:1;
      uint64_t NFEE:1;
      uint64_t NREE:1;
      uint64_t reservedSpace1:1;
      uint64_t NWRE:1;
      uint64_t NDSS:2;
      uint64_t NLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIF:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRE:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRE:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRER;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IREE:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIREER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFEE:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIFEER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFE:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IPUE:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIPUER;

};

#define WKPU (*(volatile struct WKPU_tag *) 0xc3f94000)

struct SSCM_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t BMODE:3;
      uint64_t reservedSpace1:3;
      uint64_t NXEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) STATUS;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DVLD:1;
      uint64_t DTSZ:4;
      uint64_t PVLB:1;
      uint64_t PRSZ:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MEMCONFIG;

  uint8_t res0[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RAE:1;
      uint64_t PAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ERROR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DEBUG_MODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DEBUGPORT;

  uint8_t res1[2];

  uint32_t PWCMPH;
  uint32_t PWCMPL;
};

#define SSCM (*(volatile struct SSCM_tag *) 0xc3fd8000)

struct ADC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWDN:1;
      uint64_t reservedSpace0:4;
      uint64_t ACKO:1;
      uint64_t ABORT:1;
      uint64_t ABORTCHAIN:1;
      uint64_t ADCLKSEL:1;
      uint64_t reservedSpace1:8;
      uint64_t CTUEN:1;
      uint64_t reservedSpace2:2;
      uint64_t JSTART:1;
      uint64_t JEDGE:1;
      uint64_t JTRGEN:1;
      uint64_t reservedSpace3:1;
      uint64_t NSTART:1;
      uint64_t reservedSpace4:4;
      uint64_t MODE_bitfield:1;
      uint64_t WLSIDE:1;
      uint64_t OWREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCSTATUS:3;
      uint64_t reservedSpace0:2;
      uint64_t ACKO:1;
      uint64_t reservedSpace1:3;
      uint64_t CHADDR:7;
      uint64_t CTUSTART:1;
      uint64_t reservedSpace2:3;
      uint64_t JSTART:1;
      uint64_t reservedSpace3:2;
      uint64_t JABORT:1;
      uint64_t NSTART:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_MSR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECH:1;
      uint64_t EOC:1;
      uint64_t JECH:1;
      uint64_t JEOC:1;
      uint64_t EOCTU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_ISR;

  uint32_t ADC0_CEOCFR0;
  uint32_t ADC0_CEOCFR1;
  uint32_t ADC0_CEOCFR2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSKECH:1;
      uint64_t MSKEOC:1;
      uint64_t MSKJECH:1;
      uint64_t MSKJEOC:1;
      uint64_t MSKEOCTU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_IMR;

  uint32_t ADC0_CIMR0;
  uint32_t ADC0_CIMR1;
  uint32_t ADC0_CIMR2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDG0L:1;
      uint64_t WDG0H:1;
      uint64_t WDG1L:1;
      uint64_t WDG1H:1;
      uint64_t WDG2L:1;
      uint64_t WDG2H:1;
      uint64_t WDG3L:1;
      uint64_t WDG3H:1;
      uint64_t WDG4L:1;
      uint64_t WDG4H:1;
      uint64_t WDG5L:1;
      uint64_t WDG5H:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_WTISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSKWDG0L:1;
      uint64_t MSKWDG0H:1;
      uint64_t MSKWDG1L:1;
      uint64_t MSKWDG1H:1;
      uint64_t MSKWDG2L:1;
      uint64_t MSKWDG2H:1;
      uint64_t MSKWDG3L:1;
      uint64_t MSKWDG3H:1;
      uint64_t MSKWDG4L:1;
      uint64_t MSKWDG4H:1;
      uint64_t MSKWDG5L:1;
      uint64_t MSKWDG5H:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_WTIMR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t DCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_DMAE;

  uint32_t ADC0_DMAR0;
  uint32_t ADC0_DMAR1;
  uint32_t ADC0_DMAR2;
  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:10;
      uint64_t reservedSpace0:6;
      uint64_t THRH:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_THRHLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:10;
      uint64_t reservedSpace0:6;
      uint64_t THRH:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_THRHLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:10;
      uint64_t reservedSpace0:6;
      uint64_t THRH:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_THRHLR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:10;
      uint64_t reservedSpace0:6;
      uint64_t THRH:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_THRHLR3;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRECONV:1;
      uint64_t PREVAL0:2;
      uint64_t PREVAL1:2;
      uint64_t PREVAL2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC0_PSCR;

