iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC56xx/emptyTargetInit/mpc5600_sfr.h
  uint8_t res27[272];

  uint32_t ADC1_CWSEL0;
  uint32_t ADC1_CWSEL1;
  uint8_t res28[8];

  uint32_t ADC1_CWSEL4;
  uint8_t res29[28];

  uint32_t ADC1_CWENR0;
  uint32_t ADC1_CWENR1;
  uint8_t res30[8];

  uint32_t ADC1_AWORR0;
  uint32_t ADC1_AWORR1;
};

#define ADC (*(volatile struct ADC_tag *) 0xffe00000)

struct SWT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WEN:1;
      uint64_t FRZ:1;
      uint64_t STP:1;
      uint64_t CSL:1;
      uint64_t SLK:1;
      uint64_t HLK:1;
      uint64_t ITR:1;
      uint64_t WND:1;
      uint64_t RIA:1;
      uint64_t reservedSpace0:15;
      uint64_t MAP_70:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWT_CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWT_IR;

  uint32_t SWT_TO;
  uint32_t SWT_WN;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WSC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWT_SR;

  uint32_t SWT_CO;
};

#define SWT (*(volatile struct SWT_tag *) 0xfff38000)

struct DSPI_DSPI_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HALT:1;
      uint64_t reservedSpace0:7;
      uint64_t SMPL_PT:2;
      uint64_t reservedSpace1:2;
      uint64_t DIS_RXF:1;
      uint64_t DIS_TXF:1;
      uint64_t MDIS:1;
      uint64_t reservedSpace2:1;
      uint64_t PCSIS:6;
      uint64_t reservedSpace3:2;
      uint64_t ROOE:1;
      uint64_t PCSSE:1;
      uint64_t MTFE:1;
      uint64_t FRZ:1;
      uint64_t DCONF:2;
      uint64_t CONT_SCKE:1;
      uint64_t MSTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_MCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t SPI_TCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:4;
      uint64_t DT:4;
      uint64_t ASC:4;
      uint64_t CSSCK:4;
      uint64_t PBR:2;
      uint64_t PDT:2;
      uint64_t PASC:2;
      uint64_t PCSSCK:2;
      uint64_t LSBFE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t FMSZ:4;
      uint64_t DBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_CTAR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:4;
      uint64_t DT:4;
      uint64_t ASC:4;
      uint64_t CSSCK:4;
      uint64_t PBR:2;
      uint64_t PDT:2;
      uint64_t PASC:2;
      uint64_t PCSSCK:2;
      uint64_t LSBFE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t FMSZ:4;
      uint64_t DBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_CTAR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:4;
      uint64_t DT:4;
      uint64_t ASC:4;
      uint64_t CSSCK:4;
      uint64_t PBR:2;
      uint64_t PDT:2;
      uint64_t PASC:2;
      uint64_t PCSSCK:2;
      uint64_t LSBFE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t FMSZ:4;
      uint64_t DBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_CTAR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:4;
      uint64_t DT:4;
      uint64_t ASC:4;
      uint64_t CSSCK:4;
      uint64_t PBR:2;
      uint64_t PDT:2;
      uint64_t PASC:2;
      uint64_t PCSSCK:2;
      uint64_t LSBFE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t FMSZ:4;
      uint64_t DBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_CTAR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:4;
      uint64_t DT:4;
      uint64_t ASC:4;
      uint64_t CSSCK:4;
      uint64_t PBR:2;
      uint64_t PDT:2;
      uint64_t PASC:2;
      uint64_t PCSSCK:2;
      uint64_t LSBFE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t FMSZ:4;
      uint64_t DBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_CTAR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR:4;
      uint64_t DT:4;
      uint64_t ASC:4;
      uint64_t CSSCK:4;
      uint64_t PBR:2;
      uint64_t PDT:2;
      uint64_t PASC:2;
      uint64_t PCSSCK:2;
      uint64_t LSBFE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t FMSZ:4;
      uint64_t DBR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_CTAR5;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POPNXTPTR:4;
      uint64_t RXCTR:4;
      uint64_t TXNXTPTR:4;
      uint64_t TXCTR:4;
      uint64_t reservedSpace0:1;
      uint64_t RFDF:1;
      uint64_t reservedSpace1:1;
      uint64_t RFOF:1;
      uint64_t reservedSpace2:5;
      uint64_t TFFF:1;
      uint64_t reservedSpace3:1;
      uint64_t TFUF:1;
      uint64_t EOQF:1;
      uint64_t reservedSpace4:1;
      uint64_t TXRXS:1;
      uint64_t TCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RFDF_DIRS:1;
      uint64_t RFDF_RE:1;
      uint64_t reservedSpace1:1;
      uint64_t RFOF_RE:1;
      uint64_t reservedSpace2:4;
      uint64_t TFFF_DIRS:1;
      uint64_t TFFF_RE:1;
      uint64_t reservedSpace3:1;
      uint64_t TFUF_RE:1;
      uint64_t EOQF_RE:1;
      uint64_t reservedSpace4:2;
      uint64_t TCF_RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_RSER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t PCS:6;
      uint64_t reservedSpace0:4;
      uint64_t CTCNT:1;
      uint64_t EOQ:1;
      uint64_t CTAS:3;
      uint64_t CONT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_PUSHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_POPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t TXCMD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_TXFR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t TXCMD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_TXFR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t TXCMD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_TXFR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:16;
      uint64_t TXCMD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DSPI0_TXFR3;

