iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC56xx/emptyTargetInit/mpc5600_sfr.h
};

#define LINFlexD_LINFlex0 (*(volatile struct LINFlexD_LINFlex0_tag *) 0xffe40000)

struct LINFlexD_LINFlex1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t SLEEP:1;
      uint64_t RBLM:1;
      uint64_t SBDT:1;
      uint64_t MME:1;
      uint64_t LBKM:1;
      uint64_t SFTM:1;
      uint64_t BF:1;
      uint64_t MBL:4;
      uint64_t AWUM:1;
      uint64_t LASE:1;
      uint64_t CFD:1;
      uint64_t CCD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_LINCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRIE:1;
      uint64_t DTIE:1;
      uint64_t DRIE:1;
      uint64_t DBEIETOIE:1;
      uint64_t DBFIE:1;
      uint64_t WUIE:1;
      uint64_t LSIE:1;
      uint64_t BOIE:1;
      uint64_t FEIE:1;
      uint64_t reservedSpace0:2;
      uint64_t HEIE:1;
      uint64_t CEIE:1;
      uint64_t BEIE:1;
      uint64_t OCIE:1;
      uint64_t SZIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_LINIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRF:1;
      uint64_t DTF:1;
      uint64_t DRF:1;
      uint64_t DBEF:1;
      uint64_t DBFF:1;
      uint64_t WUF:1;
      uint64_t RPS:1;
      uint64_t RBSY:1;
      uint64_t reservedSpace0:1;
      uint64_t RMB:1;
      uint64_t reservedSpace1:2;
      uint64_t LINS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_LINSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NF:1;
      uint64_t reservedSpace0:6;
      uint64_t BOF:1;
      uint64_t FEF:1;
      uint64_t IDPEF:1;
      uint64_t BDEF:1;
      uint64_t SFEF:1;
      uint64_t CEF:1;
      uint64_t BEF:1;
      uint64_t OCF:1;
      uint64_t SZF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_LINESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART:1;
      uint64_t WL_0:1;
      uint64_t PCE:1;
      uint64_t PC0:1;
      uint64_t TXEN:1;
      uint64_t RXEN:1;
      uint64_t PC1:1;
      uint64_t WL_1:1;
      uint64_t TFBM:1;
      uint64_t RFBM:1;
      uint64_t RDFLRFC:3;
      uint64_t TDFLTFC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_UARTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NF:1;
      uint64_t DTFTFF:1;
      uint64_t DRFRFE:1;
      uint64_t TO:1;
      uint64_t reservedSpace0:1;
      uint64_t WUF:1;
      uint64_t RPS:1;
      uint64_t BOF:1;
      uint64_t FEF:1;
      uint64_t RMB:1;
      uint64_t PE:4;
      uint64_t OCF:1;
      uint64_t SZF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_UARTSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:8;
      uint64_t TOCE:1;
      uint64_t IOT:1;
      uint64_t LTOM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_LINTCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OC1:8;
      uint64_t OC2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_LINOCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTO:7;
      uint64_t reservedSpace0:1;
      uint64_t RTO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_LINTOCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_F:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_LINFBRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_M:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_LINIBRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_LINCFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HTRQ:1;
      uint64_t ABRQ:1;
      uint64_t DTRQ:1;
      uint64_t DDRQ:1;
      uint64_t WURQ:1;
      uint64_t IOPE:1;
      uint64_t IOBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_LINCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:6;
      uint64_t reservedSpace0:2;
      uint64_t CCS:1;
      uint64_t DIR:1;
      uint64_t DFL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_BIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:8;
      uint64_t DATA1:8;
      uint64_t DATA2:8;
      uint64_t DATA3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_BDRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA4:8;
      uint64_t DATA5:8;
      uint64_t DATA6:8;
      uint64_t DATA7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_BDRM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FACT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_IFER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFMI:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_IFMI;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINFlex1_IFMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SR1:1;
      uint64_t STOP:1;
      uint64_t RDLIS:1;
      uint64_t TDLIS:1;
      uint64_t RDFBM:1;
      uint64_t TDFBM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTO:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTPTO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTO:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTCTO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMATXE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMARXE;

