iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/MPC56xx/emptyTargetInit/mpc5600_sfr.h
};

#define LINFlexD_LINFlex1 (*(volatile struct LINFlexD_LINFlex1_tag *) 0xffe44000)

struct PCU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN:4;
      uint64_t HALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace1:2;
      uint64_t STBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCU_PCONF0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN:4;
      uint64_t HALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace1:2;
      uint64_t STBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCU_PCONF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN:4;
      uint64_t HALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace1:2;
      uint64_t STBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCU_PCONF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RST:1;
      uint64_t TEST:1;
      uint64_t SAFE:1;
      uint64_t DRUN:1;
      uint64_t RUN:4;
      uint64_t HALT0:1;
      uint64_t reservedSpace0:1;
      uint64_t STOP0:1;
      uint64_t reservedSpace1:2;
      uint64_t STBY0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCU_PCONF3;

  uint8_t res0[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCU_PSTAT;

  uint8_t res1[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t V_LVD_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VREG_CTL;

};

#define PCU (*(volatile struct PCU_tag *) 0xc3fe8000)

